# Taps
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "stripe/stripe-cli"

# Devtools
brew "act"
brew "age"
# brew "automake"
# brew "bison"
# brew "blueutil"
# brew "boost"
# brew "gdbm"
# brew "glib"
# brew "libffi"
# brew "python3"
brew "chezmoi"
# brew "cocoapods"
# brew "coreutils"
# brew "folly"
# brew "edencommon"
# brew "fizz"
# brew "wangle"
# brew "fbthrift"
# brew "fb303"
brew "fd"
# brew "gnutls"
# brew "harfbuzz"
# brew "libass"
# brew "tesseract"
# brew "ffmpeg"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gh"
# brew "ghostscript"
# brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-flow-avh"
brew "gnu-sed"
# brew "libksba"
brew "gnupg"
brew "go"
# brew "gobject-introspection"
brew "hadolint"
brew "highlight"
brew "htop"
# brew "libheif"
# brew "libraw"
brew "imagemagick"
brew "jq"
# brew "libyaml"
brew "lsd"
brew "luarocks"
# brew "luv"
# brew "node"
brew "markdownlint-cli"
brew "maven"
brew "neovim", args: ["HEAD"]
# brew "nghttp2"
# brew "node-build"
brew "nodenv"
brew "pinentry-mac"
brew "ranger"
# brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
# brew "spotify-tui"
# brew "spotifyd"
brew "stylua"
brew "telnet"
brew "thefuck"
brew "tmux"
# brew "transcrypt"
brew "trash"
brew "tree"
brew "unzip"
brew "vale"
brew "vim"
# brew "watchman"
brew "wget"
brew "yamllint"
# brew "yarn"
# brew "zlib"
brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# From taps
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "stripe/stripe-cli/stripe"

# Casks
# cask "adoptopenjdk8"
cask "aerial"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "cocoapods"
cask "dashlane"
cask "discord"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keycastr"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "ngrok"
cask "notion"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "ukelele"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "warp"
cask "whichspace"
cask "zeplin"
