tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "minio/stable"
tap "ngrok/ngrok"
tap "stripe/stripe-cli"
brew "act"
brew "age"
brew "webp"
brew "bat"
brew "chezmoi"
brew "fd"
brew "unbound"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow-avh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gtk+3"
brew "hadolint"
brew "highlight"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "luarocks"
brew "node"
brew "markdownlint-cli"
brew "maven"
brew "neovim"
brew "nodenv"
brew "openvpn", restart_service: true
brew "pinentry-mac"
brew "postgresql@14"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "stylua"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "trash"
brew "tree"
brew "unzip"
brew "vale"
brew "vim"
brew "vint"
brew "wget"
brew "yamllint"
brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "minio/stable/mc"
brew "stripe/stripe-cli/stripe"
cask "aerial"
cask "alacritty"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "arc"
cask "chromium"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gimp"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keycastr"
cask "meetingbar"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "postman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "trailer"
cask "tunnelblick"
cask "ukelele"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "whichspace"
cask "xbar"
cask "zeplin"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "andrejunges.Handlebars"
vscode "Angular.ng-template"
vscode "AntonLilleby.xp-freemarker-formatter"
vscode "asciidoctor.asciidoctor-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bbenoist.vagrant"
vscode "bierner.docs-view"
vscode "bmuskalla.vscode-tldr"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "CodeSandbox-io.codesandbox-projects"
vscode "CodeStream.codestream"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-office"
vscode "DavidAnson.vscode-markdownlint"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "dcasella.i3"
vscode "dcortes92.FreeMarker"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "donjayamanne.jquerysnippets"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "EQuimper.react-native-react-redux"
vscode "erichbehrens.pull-request-monitor"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "glenn2223.live-sass"
vscode "goessner.mdmath"
vscode "Greenbyte.handlebars-preview"
vscode "GregorBiswanger.json2ts"
vscode "hediet.vscode-drawio"
vscode "hoovercj.vscode-power-mode"
vscode "HTMLHint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "IBM.output-colorizer"
vscode "infeng.vscode-react-typescript"
vscode "James-Yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mike-lischke.vscode-antlr4"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mkhl.shfmt"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "natqe.reload"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "pascalsenn.keyboard-quickfix"
vscode "pflannery.vscode-versionlens"
vscode "phind.phind"
vscode "PKief.material-icon-theme"
vscode "puorc.awesome-vhdl"
vscode "quicktype.quicktype"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rogalmic.bash-debug"
vscode "ryuta46.multi-command"
vscode "sburg.vscode-javascript-booster"
vscode "shardulm94.trailing-spaces"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "softwaredotcom.swdc-vscode"
vscode "styled-components.vscode-styled-components"
vscode "syler.sass-indented"
vscode "TabNine.tabnine-vscode"
vscode "timonwong.shellcheck"
vscode "tomwhite007.rename-angular-component"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.codetour"
vscode "VSpaceCode.whichkey"
vscode "WakaTime.vscode-wakatime"
vscode "WallabyJs.wallaby-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "webfreak.debug"
vscode "xabikos.JavaScriptSnippets"
vscode "xyz.local-history"
vscode "xyz.plsql-language"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
