tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "jorgerojas26/lazysql"
tap "koekeishiya/formulae"
tap "minio/stable"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "stripe/stripe-cli"
brew "act"
brew "age"
brew "webp"
brew "glib"
brew "openssl@3"
brew "bat"
brew "chezmoi"
brew "deno"
brew "difftastic"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "sdl2"
brew "tesseract"
brew "ffmpeg"
brew "fnm"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow-avh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gtk+3"
brew "hadolint"
brew "handbrake", link: false
brew "highlight"
brew "htop"
brew "icu4c@75"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "lsd"
brew "luarocks"
brew "make"
brew "node"
brew "markdownlint-cli"
brew "openjdk"
brew "maven"
brew "minikube"
brew "mpv"
brew "mysql-client@8.4"
brew "mysql@8.4"
brew "neovim"
brew "nodenv"
brew "ollama"
brew "openvpn", restart_service: :changed
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt@5"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "sqlfluff"
brew "stylua"
brew "television"
brew "telnet"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "unzip"
brew "uv"
brew "vale"
brew "vim"
brew "vint"
brew "wget"
brew "yamllint"
brew "zsh"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "jorgerojas26/lazysql/lazysql"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "minio/stable/mc"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
brew "stripe/stripe-cli/stripe"
cask "aerial"
cask "alacritty"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "arc"
cask "betterdisplay"
cask "chromium"
cask "discord"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gimp"
cask "google-chrome"
cask "gyroflow"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "lm-studio"
cask "miniconda"
cask "nordvpn"
cask "notion"
cask "philips-hue-sync"
cask "postman"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "slack"
cask "slite"
cask "spotify"
cask "steam"
cask "stremio"
cask "the-unarchiver"
cask "trailer"
cask "tunnelblick"
cask "ukelele"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "whichspace"
cask "xbar"
cask "zeplin"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "andenetalexander.vim-cheatsheet"
vscode "andrejunges.handlebars"
vscode "antonlilleby.xp-freemarker-formatter"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.docs-view"
vscode "bmuskalla.vscode-tldr"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chaitanyashahare.lazygit"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotenv.dotenv-vscode"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equimper.react-native-react-redux"
vscode "erichbehrens.pull-request-monitor"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glenn2223.live-sass"
vscode "goessner.mdmath"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "greenbyte.handlebars-preview"
vscode "gregorbiswanger.json2ts"
vscode "hediet.vscode-drawio"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "infeng.vscode-react-typescript"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mkhl.shfmt"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "natqe.reload"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "pascalsenn.keyboard-quickfix"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rooveterinaryinc.roo-cline"
vscode "ryuta46.multi-command"
vscode "saoudrizwan.claude-dev"
vscode "sburg.vscode-javascript-booster"
vscode "shardulm94.trailing-spaces"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "styled-components.vscode-styled-components"
vscode "supermaven.supermaven"
vscode "syler.sass-indented"
vscode "timonwong.shellcheck"
vscode "tomwhite007.rename-angular-component"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vsls-contrib.codetour"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "xyz.local-history"
vscode "xyz.plsql-language"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
